Revit 2027 API
FamilyManager.IsUserAssignableParameterGroup Method
 Checks if the given parameter group can be assigned to new parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUserAssignableParameterGroup(
	ForgeTypeId groupTypeId
)
Public Function IsUserAssignableParameterGroup (
	groupTypeId As ForgeTypeId
) As Boolean
public:
bool IsUserAssignableParameterGroup(
	ForgeTypeId^ groupTypeId
)
member IsUserAssignableParameterGroup :
        groupTypeId : ForgeTypeId -> bool
Parameters
groupTypeId ForgeTypeId
Return Value
Boolean
 True if the parameter group can be assigned to new parameters, false otherwise.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace